# Найдите колличество журавликов

num_of_crane = int(input("Введите число журавликов: "))
x = num_of_crane // 6
y = 4 * x
print(x, y, x)
